In [1]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

/var/folders/rg/vtjd9wkj6cq1lck908ywby500000gn/T/ipykernel_3271/3777615979.py:1: DeprecationWarning: Importing display from IPython.core.display is deprecated since IPython 7.14, please import from IPython display
  from IPython.core.display import display, HTML

In [6]:
import numpy as np
import pandas as pd

## Project 1. Due by Thursday, February 13. ##

For this project we will use the **London Underground Data**.

1. Compute a Minimum Spanning Tree using, as costs, the straight-line distances of the provided connections, i.e., length of connections computed using the latitude and longitude of each node.

2. Repeat this computation, now using the length of connections provided in the data.

3. Using version 2 of the lengths, we will investigate the robustness of the computation.  We conduct 10000 experiments.  In each experiment the length of each connection is adjusted as follows:
        modified length = max{ (true length)*(1 + Gaussian(0,0.3)), 0.01*(true length) }
i.e., we modify the length randomly using a zero-norm Gaussian distribution with standard deviation 0.3 and correct if the length becomes too small.

  Plot the distribution of minimum spanning tree lengths, as well as the Value-At-Risk at level 5%.

4. Returning to the lengths as in version 2, conduct a delete-and-repair analysis.  That is to say, for each link L of the minimum spanning tree, we

    (a) Remove L from the network.
    
    (b) Compute a minimum spanning tree for the network with L (and only L) removed.  

  Plot the resulting values for the length of the minimum spanning tree.

Note: we only remove one link at a time.

### IMPORTANT ###
1. Please do not submit data.  If you need to generate additional data, submit the code for that as well.
2. By the due date for the project, please make an appointment with the TAs/CAs.

### Loading Data
Each csv file was loaded into a Pandas dataframe

In [21]:
connections = pd.read_csv("./London Underground/connections.csv", index_col=0)
lines = pd.read_csv("./London Underground/lines.csv")
stations = pd.read_csv("./London Underground/stations.csv")
connections

     station1  station2  line  time  distance(miles)
0          11       163     1   1.0         0.257855
1          11       212     1   2.0         0.454449
2          49        87     1   1.0         0.111148
3          49       197     1   2.0         0.426744
4          82       163     1   2.0         0.273407
..        ...       ...   ...   ...              ...
428       326       327    14   NaN         6.740020
429       327       328    14   NaN         4.810656
430       319       330    14   NaN         2.606461
431       330       331    14   NaN              NaN
432       330       333    14   NaN              NaN

[433 rows x 5 columns]

In [22]:
lines

    line                     name  colour
0      1            Bakerloo Line  AE6017
1      2             Central Line  F15B2E
2      3              Circle Line  FFE02B
3      4            District Line  00A166
4      5         East London Line  FBAE34
5      6  Hammersmith & City Line  F491A8
6      7             Jubilee Line  949699
7      8        Metropolitan Line  91005A
8      9            Northern Line  000000
9     10          Piccadilly Line  094FA3
10    11            Victoria Line  0A9CDA
11    12     Waterloo & City Line  88D0C4
12    13  Docklands Light Railway  00A77E
13    14           Elizabeth Line  60399E

In [24]:
stations.rename(columns={"Unnamed: 0": "station"}, inplace=True)
stations

,station,latitude,longitude,name,zone,total_lines,rail
0,1,51.502800,-0.280100,Acton Town,3.0,2.0,0.0
1,2,51.514300,-0.075500,Aldgate,1.0,2.0,0.0
2,3,51.515400,-0.072600,Aldgate East,1.0,2.0,0.0
3,4,51.510700,-0.013000,All Saints,2.0,1.0,0.0
4,5,51.540700,-0.299700,Alperton,4.0,1.0,0.0
...,...,...,...,...,...,...,...
327,329,51.503095,-0.420452,Hayes & Harlington,5,NaN,NaN
328,330,51.471318,-0.453178,Heathrow Terminals 2 & 3,6,NaN,NaN
329,331,NaN,NaN,Heathrow Terminals 4,NaN,NaN,NaN
330,332,51.471318,-0.453178,Heathrow Terminals 2 & 3,6,NaN,NaN
331,333,NaN,NaN,Heathrow Terminals 5,NaN,NaN,NaN

### 1. Compute a Minimum Spanning Tree using, as costs, the straight-line distances of the provided connections, i.e., length of connections computed using the latitude and longitude of each node.